sicreative/ST_TaiChi/ST_TAICHI/Projects/STM32L4R9ZI-STWIN/Demonstrations/TaiChi/Src/sensor_service.c
/**
  ******************************************************************************
  * @file    sensor_service.c
  * @author  System Research & Applications Team - Catania Lab.
  * @version V2.2.0
  * @date    16-March-2020
  * @brief   Add 4 bluetooth services using vendor specific profiles.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#include <stdio.h>
#include "TargetFeatures.h"
#include "main.h"
#include "sensor_service.h"
//#include "MetaDataManager.h"
//#include "console.h"
#include "bluenrg1_l2cap_aci.h"
#include "uuid_ble_service.h"
#include "OTA.h"

/** @addtogroup Projects
  * @{
  */

/** @addtogroup DEMONSTRATIONS Demonstrations
  * @{
  */

/** @addtogroup PREDCTIVE_MAINTENANCE Predictive Maintenance BLE
  * @{
  */

/** @addtogroup PREDCTIVE_MAINTENANCE_SENSOR_SERVICE Predictive Maintenance sensor service
  * @{
  */

/* Exported variables ---------------------------------------------------------*/
int connected = FALSE;
uint8_t set_connectable = FALSE;

// Indicate the iBeacon is advertising
uint8_t isBeacon = TRUE;


volatile uint32_t FeatureMask;

/* Imported Variables -------------------------------------------------------------*/
extern uint32_t ConnectionBleStatus;
  
extern uint32_t FirstConnectionConfig;

extern TIM_HandleTypeDef    TimCCHandle;
extern TIM_HandleTypeDef    TimEnvHandle;
extern TIM_HandleTypeDef    TimAudioDataHandle;

extern volatile uint32_t PredictiveMaintenance;

extern volatile uint32_t FFT_Amplitude;
extern volatile uint32_t FFT_Alarm;

extern sAccelerometer_Parameter_t Accelerometer_Parameters;
extern uint8_t IsFirstTime;

extern volatile float RMS_Ch[];

extern float DBNOISE_Value_Old_Ch[];

extern uint8_t bdaddr[6];
extern uint8_t NodeName[8];

extern uint32_t uhCCR4_Val;




/* Private variables ------------------------------------------------------------*/
#ifdef DISABLE_FOTA
static uint32_t FirstCommandSent= 1;
#endif /* DISABLE_FOTA */

static uint16_t HWServW2STHandle;
static uint16_t EnvironmentalCharHandle;
static uint16_t AccGyroMagCharHandle;
static uint16_t AudioLevelCharHandle;
static uint16_t BatteryFeaturesCharHandle;

static uint16_t SWServW2STHandle;
static uint16_t FFTAmplitudeCharHandle;
static uint16_t TimeDomainCharHandle;
static uint16_t FFTAlarmSpeedRMS_StatusCharHandle;
static uint16_t FFTAlarmAccStatusCharHandle;
static uint16_t FFTAlarmSubrangeStatusCharHandle;

static uint16_t ConfigServW2STHandle;
static uint16_t ConfigCharHandle;

static uint16_t ConsoleW2STHandle;
static uint16_t TermCharHandle;
static uint16_t StdErrCharHandle;


static uint16_t TaiChiServW2STHandle;
static uint16_t TaiChiCharHandle;


static uint8_t LastStderrBuffer[W2ST_MAX_CHAR_LEN];
static uint8_t LastStderrLen;
static uint8_t LastTermBuffer[W2ST_MAX_CHAR_LEN];
static uint8_t LastTermLen;

static uint8_t VibrParam[80];

static uint8_t  EnvironmentalCharSize = 2; /* Size for Environmental BLE characteristic */

static uint32_t SizeOfUpdateBlueFW=0;

static uint16_t connection_handle = 0;

volatile uint8_t BLE_Buffer_Full=0;

Service_UUID_t service_uuid;
Char_UUID_t char_uuid;

/* Private functions ------------------------------------------------------------*/
//static void GAP_ConnectionComplete_CB(uint8_t addr[6], uint16_t handle);
//static void GAP_DisconnectionComplete_CB(void);
static uint32_t DebugConsoleCommandParsing(uint8_t * att_data, uint8_t data_length);
static uint32_t ConfigCommandParsing(uint8_t * att_data, uint8_t data_length);
static void Read_Request_CB(uint16_t handle);
static void Attribute_Modified_Request_CB(uint16_t Connection_Handle, uint16_t attr_handle, uint16_t Offset, uint8_t data_length, uint8_t *att_data);

static void Force_UUID_Rescan(void);
static uint8_t VibrationParametersCommandParsing(uint8_t CommandLenght);

/************************************/
/* Hardware Characteristics Service */
/************************************/
static void Environmental_AttributeModified_CB(uint8_t *att_data);
static void AccGyroMag_AttributeModified_CB(uint8_t *att_data);
static void AudioLevel_AttributeModified_CB(uint8_t *att_data);
static void BatteryFeatures_AttributeModified_CB(uint8_t *att_data);

/***********************************
* Software Characteristics Service *
************************************/
static void FFTAmplitude_AttributeModified_CB(uint8_t *att_data);
static void TimeDomain_AttributeModified_CB(uint8_t *att_data);
static void FFTAlarmSpeedRMS_AttributeModified_CB(uint8_t *att_data);
static void FFTAlarmAccStatus_AttributeModified_CB(uint8_t *att_data);
static void FFTAlarmSubrangeStatus_AttributeModified_CB(uint8_t *att_data);

