sicreative/ST_TaiChi/ST_TAICHI/Projects/STM32L4R9ZI-STWIN/Demonstrations/TaiChi/Src/sensor_service.c
  uint8_t buff[2+2+2+2+1];

  STORE_LE_16(buff  ,(HAL_GetTick()>>3));
  STORE_LE_16(buff+2,BatteryLevel*10);
  STORE_LE_16(buff+4,Voltage);
  STORE_LE_16(buff+6,-32768);

  /* if it's < 15% Low Battery*/
  if(BatteryLevel < 15) {
    /* Low Battery */
    buff[8] = 0x00; 
  } else {
    /* Unknown */
    static uint32_t Status= 0x04;
    
    /* Charging */
    if(BC_State.Id == ChargingPhase)
      Status = 0x03;
    
    /* Plugget Not Charging */
    if(BC_State.Id == EndOfCharge)
      Status = 0x02;
    
    /* Discharging */
    if(BC_State.Id == ValidInput)
      Status = 0x01;
    
    buff[8] = Status;
  }

  ret = aci_gatt_update_char_value(HWServW2STHandle, BatteryFeaturesCharHandle, 0, 2+2+2+2+1,buff);

  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating Battery Info Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    } else {
      PREDMNT1_PRINTF("Error Updating Battery Info Char\r\n");
    }
    return BLE_STATUS_ERROR;
  }
  return BLE_STATUS_SUCCESS;
}


/*
 * @brief  Update FFT Amplitude characteristic value
 * @param  uint8_t *TotalBuff
 * @param  uint16_t ActualMagSize Number of samples
 * @param  uint8_t *SendingFFT
 * @param  uint16_t *CountSendData
 * @retval tBleStatus   Status
 */
tBleStatus FFT_Amplitude_Update(uint8_t *TotalBuff, uint16_t ActualMagSize, uint8_t *SendingFFT, uint16_t *CountSendData)
{
  tBleStatus ret;
  
  uint16_t TotalSize;
  
  uint16_t index;
  uint16_t indexStart;
  uint16_t indexStop;
  
  uint8_t Buff[20];
  
  uint8_t  NumByteSent;

  TotalSize= 2 /* nSample */ + 1 /* nComponents */ + 4 /*  Frequency Steps */ + ((3 * ActualMagSize) * 4) /* Samples */;

  indexStart= 20 * (*CountSendData);
  indexStop=  20 * ((*CountSendData) + 1);

  NumByteSent= 20;
  
  if(indexStop > TotalSize)
  {
    indexStop= TotalSize;
    NumByteSent= TotalSize % NumByteSent;
  }
  
  for(index=indexStart; index<indexStop; index++)
  {
    Buff[index - indexStart]= TotalBuff[index];
  }
  
  if(!BLE_Buffer_Full)
  {
    ret = aci_gatt_update_char_value(SWServW2STHandle, FFTAmplitudeCharHandle, 0, NumByteSent,Buff);
    
    if (ret != BLE_STATUS_SUCCESS)
    {
      /* When the requested operation failed for a temporary lack of resources, repeats sending after 200 ms*/
      if(ret == BLE_STATUS_INSUFFICIENT_RESOURCES)
      {
        BLE_Buffer_Full = 1;
      }
      else
      {
        return BLE_STATUS_ERROR;
      }
    }
    else
    {
      (*CountSendData)++;
      
      if(indexStop == TotalSize)
      {
        *SendingFFT= 0;
        *CountSendData= 0;
      }
    }
  }

  return BLE_STATUS_SUCCESS;
}

/**
  * @brief Each time BLE FW stack raises the error code @ref ble_status_insufficient_resources (0x64),
           the @ref aci_gatt_tx_pool_available_event event is generated as soon as the available buffer size 
           is greater than maximum ATT MTU (on stack versions below v2.1 this event is generated when at least 2 packets
           with MTU of 23 bytes are available).
  * @param Connection_Handle Connection handle related to the request
  * @param Available_Buffers Not used.
  * @retval None
*/
void aci_gatt_tx_pool_available_event(uint16_t Connection_Handle, uint16_t Available_Buffers)
{
  BLE_Buffer_Full=0;
}

/*
 * @brief  Update Time Domain characteristic value
 * @param  sAcceleroParam_t *sTimeDomain
 * @retval tBleStatus   Status
 */
tBleStatus TimeDomain_Update(sAcceleroParam_t *sTimeDomain)
{
  tBleStatus ret;
  uint16_t Temp;
  
  uint8_t Buff[2 + 18];
  uint8_t BuffPos;
  
  float TempFloat;
  uint8_t *TempBuff = (uint8_t *) & TempFloat;
  
  STORE_LE_16(Buff  ,(HAL_GetTick()>>3));

  Temp= (uint16_t)(sTimeDomain->AccPeak.AXIS_X * 100);
  STORE_LE_16(Buff+2 ,Temp);
  
  Temp= (uint16_t)(sTimeDomain->AccPeak.AXIS_Y * 100);
  STORE_LE_16(Buff+4 ,Temp);
  
  Temp= (uint16_t)(sTimeDomain->AccPeak.AXIS_Z * 100);
  STORE_LE_16(Buff+6 ,Temp);
  
  BuffPos= 8;
  
  TempFloat = sTimeDomain->SpeedRms.AXIS_X * 1000;
  Buff[BuffPos]= TempBuff[0];
  BuffPos++;
  Buff[BuffPos]= TempBuff[1];
  BuffPos++;
  Buff[BuffPos]= TempBuff[2];
  BuffPos++;
  Buff[BuffPos]= TempBuff[3];
  BuffPos++;
 
  TempFloat = sTimeDomain->SpeedRms.AXIS_Y * 1000;
  Buff[BuffPos]= TempBuff[0];
  BuffPos++;
  Buff[BuffPos]= TempBuff[1];
  BuffPos++;
  Buff[BuffPos]= TempBuff[2];
  BuffPos++;
  Buff[BuffPos]= TempBuff[3];
  BuffPos++;
  
  TempFloat = sTimeDomain->SpeedRms.AXIS_Z * 1000;
  Buff[BuffPos]= TempBuff[0];
  BuffPos++;
  Buff[BuffPos]= TempBuff[1];
  BuffPos++;
  Buff[BuffPos]= TempBuff[2];
  BuffPos++;
  Buff[BuffPos]= TempBuff[3];
  BuffPos++;
  
  ret = aci_gatt_update_char_value(SWServW2STHandle, TimeDomainCharHandle, 0, 20,Buff);

  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite =sprintf((char *)BufferToWrite, "Error Updating Time Domain Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    } else {
      PREDMNT1_PRINTF("Error Updating Time Domain Char = \r\n");
    }
    return BLE_STATUS_ERROR;
  }
  
  return BLE_STATUS_SUCCESS;
}

/*
 * @brief  Update FFT Alarm Speed RMS status value
 * @param  sTimeDomainAlarm_t *pTdAlarm
 * @retval tBleStatus   Status
 */
tBleStatus FFT_AlarmSpeedRMS_Status_Update(sTimeDomainAlarm_t *pTdAlarm, sAcceleroParam_t *sTimeDomainVal)
{
  tBleStatus ret;
  
  float TempFloat;
  uint8_t *TempBuff = (uint8_t *) & TempFloat;
  
  uint8_t Buff[2 + 13];
  uint8_t BuffPos;
  uint8_t Temp;
  
  STORE_LE_16(Buff  ,(HAL_GetTick()>>3));
  
  Temp= 0x00;
  Temp= (pTdAlarm->RMS_STATUS_AXIS_X << 4) | (pTdAlarm->RMS_STATUS_AXIS_Y  << 2) | (pTdAlarm->RMS_STATUS_AXIS_Z);
  Buff[2]= Temp;
  
  BuffPos= 3;
  
  TempFloat = sTimeDomainVal->SpeedRms.AXIS_X;
  Buff[BuffPos]= TempBuff[0];
  BuffPos++;
  Buff[BuffPos]= TempBuff[1];
  BuffPos++;
  Buff[BuffPos]= TempBuff[2];
  BuffPos++;
  Buff[BuffPos]= TempBuff[3];
  BuffPos++;
 
  TempFloat = sTimeDomainVal->SpeedRms.AXIS_Y;
  Buff[BuffPos]= TempBuff[0];
  BuffPos++;
  Buff[BuffPos]= TempBuff[1];
  BuffPos++;
  Buff[BuffPos]= TempBuff[2];
  BuffPos++;
  Buff[BuffPos]= TempBuff[3];
  BuffPos++;
  
