sicreative/ST_TaiChi/ST_TAICHI/Projects/STM32L4R9ZI-STWIN/Demonstrations/TaiChi/Src/sensor_service.c
  TempFloat = sTimeDomainVal->SpeedRms.AXIS_Z;
  Buff[BuffPos]= TempBuff[0];
  BuffPos++;
  Buff[BuffPos]= TempBuff[1];
  BuffPos++;
  Buff[BuffPos]= TempBuff[2];
  BuffPos++;
  Buff[BuffPos]= TempBuff[3];
  BuffPos++;
    
  
  ret = aci_gatt_update_char_value(SWServW2STHandle, FFTAlarmSpeedRMS_StatusCharHandle, 0, 2+13, Buff);

  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite =sprintf((char *)BufferToWrite, "Error Updating FFT Alarm Speed Status Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    } else {
      PREDMNT1_PRINTF("Error Updating FFT Alarm Speed Status Char = \r\n");
    }
    return BLE_STATUS_ERROR;
  }
  
  return BLE_STATUS_SUCCESS;
}

/*
 * @brief  Update FFT Alarm Acc status value
 * @param  sTimeDomainAlarm_t *pTdAlarm
 * @retval tBleStatus   Status
 */
tBleStatus FFT_AlarmAccStatus_Update(sTimeDomainAlarm_t *pTdAlarm, sAcceleroParam_t *sTimeDomainVal)
{
  tBleStatus ret;
  
  float TempFloat;
  uint8_t *TempBuff = (uint8_t *) & TempFloat;
  
  uint8_t Buff[2 + 13];
  uint8_t BuffPos;
  uint8_t Temp;
  
  STORE_LE_16(Buff  ,(HAL_GetTick()>>3));
  
  Temp= 0x00;
  Temp= (pTdAlarm->PK_STATUS_AXIS_X << 4) | (pTdAlarm->PK_STATUS_AXIS_Y  << 2) | (pTdAlarm->PK_STATUS_AXIS_Z);
  Buff[2]= Temp;
  
  BuffPos= 3;
  
  TempFloat = sTimeDomainVal->AccPeak.AXIS_X;
  Buff[BuffPos]= TempBuff[0];
  BuffPos++;
  Buff[BuffPos]= TempBuff[1];
  BuffPos++;
  Buff[BuffPos]= TempBuff[2];
  BuffPos++;
  Buff[BuffPos]= TempBuff[3];
  BuffPos++;
 
  TempFloat = sTimeDomainVal->AccPeak.AXIS_Y;
  Buff[BuffPos]= TempBuff[0];
  BuffPos++;
  Buff[BuffPos]= TempBuff[1];
  BuffPos++;
  Buff[BuffPos]= TempBuff[2];
  BuffPos++;
  Buff[BuffPos]= TempBuff[3];
  BuffPos++;
  
  TempFloat = sTimeDomainVal->AccPeak.AXIS_Z;
  Buff[BuffPos]= TempBuff[0];
  BuffPos++;
  Buff[BuffPos]= TempBuff[1];
  BuffPos++;
  Buff[BuffPos]= TempBuff[2];
  BuffPos++;
  Buff[BuffPos]= TempBuff[3];
  BuffPos++;
    
  
  ret = aci_gatt_update_char_value(SWServW2STHandle, FFTAlarmAccStatusCharHandle, 0, 2+13, Buff);

  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite =sprintf((char *)BufferToWrite, "Error Updating FFT Alarm Acc Status Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    } else {
      PREDMNT1_PRINTF("Error Updating FFT Alarm Acc Status Char = \r\n");
    }
    return BLE_STATUS_ERROR;
  }
  
  return BLE_STATUS_SUCCESS;
}

/*
 * @brief  Update FFT Alarm Subrange Status
 * @param  sTimeDomainAlarm_t *pTdAlarm
 * @retval tBleStatus   Status
 */
tBleStatus FFT_AlarmSubrangeStatus_Update(sAxesMagResults_t *AccAxesMagResults,sFreqDomainAlarm_t *THR_Fft_Alarms, uint16_t SubrangeNum, uint16_t ActualMagSize)
{
  tBleStatus ret;
  float BinFreqStep;
  float SendValue;
  
  Alarm_Type_t TempAlarm_X = GOOD;
  Alarm_Type_t TempAlarm_Y = GOOD;
  Alarm_Type_t TempAlarm_Z = GOOD;
  
  uint8_t Buff[2 + 13];
  uint8_t Temp;
  
  for(int i=0; i<SubrangeNum; i++)
  {
    TempAlarm_X = ALARM_MAX(TempAlarm_X, THR_Fft_Alarms->STATUS_AXIS_X[i]);
    TempAlarm_Y = ALARM_MAX(TempAlarm_X, THR_Fft_Alarms->STATUS_AXIS_Y[i]);
    TempAlarm_Z = ALARM_MAX(TempAlarm_X, THR_Fft_Alarms->STATUS_AXIS_Z[i]);
  }

  STORE_LE_16(Buff  ,(HAL_GetTick()>>3));

  Temp= 0x00;
  Temp= (TempAlarm_X << 4) | (TempAlarm_Y  << 2) | (TempAlarm_Z);
  Buff[2]= Temp;
  
  BinFreqStep = (AcceleroODR.Frequency/2) / ActualMagSize;
  
  /* X */
  SendValue= (float)(AccAxesMagResults->X_Index*BinFreqStep);
  STORE_LE_16(Buff + 3, ((uint16_t)(SendValue * 10)));
  SendValue= AccAxesMagResults->X_Value;
  STORE_LE_16(Buff + 5, ((uint16_t)(SendValue * 100)));
  
  /* Y */
  SendValue= (float)(AccAxesMagResults->Y_Index*BinFreqStep);
  STORE_LE_16(Buff + 7, ((uint16_t)(SendValue * 10)));
  SendValue= AccAxesMagResults->Y_Value;
  STORE_LE_16(Buff + 9, ((uint16_t)(SendValue * 100)));
  
  /* Z */
  SendValue= (float)(AccAxesMagResults->Z_Index*BinFreqStep);
  STORE_LE_16(Buff + 11, ((uint16_t)(SendValue * 10)));
  SendValue= AccAxesMagResults->Z_Value;
  STORE_LE_16(Buff + 13, ((uint16_t)(SendValue * 100)));
  
  ret = aci_gatt_update_char_value(SWServW2STHandle, FFTAlarmSubrangeStatusCharHandle, 0, 2+13, Buff);

  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite =sprintf((char *)BufferToWrite, "Error Updating FFT Alarm Subrange Status Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    } else {
      PREDMNT1_PRINTF("Error Updating FFT Alarm Subrange Status Char = \r\n");
    }
    return BLE_STATUS_ERROR;
  }
  
  return BLE_STATUS_SUCCESS;
}


/**
 * @brief  Puts the device in connectable mode.
 * @param  None
 * @retval None
 */
void setBeacon(void)
{

/*Set iBeacon avertising packet based on Apple Proximity beacon specification 2.1 */
	  uint8_t beacon[31] =
	  {0x02,0x01,0x06,0x1A,0xFF,0x4C,0x00,0x02,0x15,
	   0x00,0x02,0x00,0x00,0x00,0x0d,0x11,0xe1,0xac,0x36,0x00,0x02,0xa5,0xd5,0xc5,0x1b,
	   0x00,0x00,0x00,0x00,0xc6,0x00};

	  /* switch off connectable */
	    aci_gap_set_non_discoverable();

	    /* switch off scanable */
	    hci_le_set_scan_enable(0x0,0x0);



/*Set advertising parameters for non connectable avertising */
	  tBleStatus ret = hci_le_set_advertising_parameters(0xA0,0xA0,ADV_NONCONN_IND,0x01,0x01,NULL,0x07,0x00);

  if(ret){
       PREDMNT1_PRINTF("\r\n set advertising error failed %d\r\n",ret);
       goto fail;
    }





  /* set beacon advertising data */
  ret = hci_le_set_advertising_data(0x1E,beacon);

  if(ret){
         PREDMNT1_PRINTF("\r\n set advertising data error failed %d\r\n",ret);
         goto fail;
      }



  /* enable beacon advertise */
  ret = hci_le_set_advertise_enable(0x01);





    if(ret){
           PREDMNT1_PRINTF("\r\n set advertising enable error failed %d\r\n",ret);
           goto fail;
        }

