sicreative/ST_TaiChi/ST_TAICHI/Projects/STM32L4R9ZI-STWIN/Demonstrations/TaiChi/Src/sensor_service.c
    fail:
	 return;


}

/**
 * @brief  Puts the device in connectable mode.
 * @param  None 
 * @retval None
 */
void setConnectable(void)
{  




  uint8_t local_name[8] = {AD_TYPE_COMPLETE_LOCAL_NAME,NodeName[1],NodeName[2],NodeName[3],NodeName[4],NodeName[5],NodeName[6],NodeName[7]};
  uint8_t manuf_data[26] = {
    2,0x0A,0x00 /* 0 dBm */, // Trasmission Power
    //8,0x09,NAME_BLUEMS, // Complete Name
    8,0x09,NodeName[1],NodeName[2],NodeName[3],NodeName[4],NodeName[5],NodeName[6],NodeName[7], // Complete Name
    13,0xFF,0x01/*SKD version */,
    0x92,  /* Changed  default Sensor.tile DeviceID 0x02 to 0x92 for TaiChi Device */
    0x00, /* AudioSync+AudioData */
    0xE0, /* ACC + Gyro + Mag + Environmental + Battery Info */
    0x00, /*  FFT Amplitude */
    0x00, /*  */
    0x00, /* BLE MAC start */
    0x00,
    0x00,
    0x00,
    0x00,
    0x00, /* BLE MAC stop */
  };
  
  /* BLE MAC */
  manuf_data[20] = bdaddr[5];
  manuf_data[21] = bdaddr[4];
  manuf_data[22] = bdaddr[3];
  manuf_data[23] = bdaddr[2];
  manuf_data[24] = bdaddr[1];
  manuf_data[25] = bdaddr[0];

  /* Mic */
  manuf_data[16] |= 0x04;

  if(TargetBoardFeatures.NumTempSensors==2) {
    /* Two Temperature values*/
    manuf_data[17] |= 0x05;
  } else if(TargetBoardFeatures.NumTempSensors==1) {
    /* One Temperature value*/
    manuf_data[17] |= 0x04; 
  }

  /* Humidity Value */
  if(TargetBoardFeatures.HumSensorIsInit)
  {
    manuf_data[17] |= 0x08;
  }

  /* Pressure value*/
  if(TargetBoardFeatures.PressSensorIsInit)
  {
    manuf_data[17] |= 0x10;
  }
  
  /* Battery Info */
  manuf_data[17] |= 0x02;
  
  /*  FFT Amplitude */
  manuf_data[19] |= 0x05;

  /*  Time Domain */
  manuf_data[19] |= 0x06;   
  
  /*  FFT Alarm */
  manuf_data[19] |= 0x07; 
  
  /* disable beacon */
  tBleStatus ret = hci_le_set_advertise_enable(0x00);


  /* disable scan response */
  hci_le_set_scan_response_data(0,NULL);


  aci_gap_set_discoverable(ADV_IND, 0, 0,
                           RANDOM_ADDR,
                           NO_WHITE_LIST_USE,
                           sizeof(local_name), local_name, 0, NULL, 0, 0);

  /* Send Advertising data */
  aci_gap_update_adv_data(26, manuf_data);


}

/**
 * @brief  This function is called when there is a Bluetooth Read request
 * @param  uint16_t handle Handle of the attribute
 * @retval None
 */
static void Read_Request_CB(uint16_t handle)
{
  if(handle == EnvironmentalCharHandle + 1){
    /* Read Request for Pressure,Humidity, and Temperatures*/
    float SensorValue;
    int32_t PressToSend=0;
    uint16_t HumToSend=0;
    int16_t Temp2ToSend=0,Temp1ToSend=0;
    int32_t decPart, intPart;

    ENV_SENSOR_GetValue(PRESSURE_INSTANCE,ENV_PRESSURE, &SensorValue);
    MCR_BLUEMS_F2I_2D(SensorValue, intPart, decPart);
    PressToSend=intPart*100+decPart;

    ENV_SENSOR_GetValue(HUMIDITY_INSTANCE,ENV_HUMIDITY,&SensorValue);
    MCR_BLUEMS_F2I_1D(SensorValue, intPart, decPart);
    HumToSend = intPart*10+decPart;

    if(TargetBoardFeatures.NumTempSensors==2) {
      ENV_SENSOR_GetValue(TEMPERATURE_INSTANCE_1,ENV_TEMPERATURE,&SensorValue);
      MCR_BLUEMS_F2I_1D(SensorValue, intPart, decPart);
      Temp1ToSend = intPart*10+decPart; 

      ENV_SENSOR_GetValue(TEMPERATURE_INSTANCE_2,ENV_TEMPERATURE,&SensorValue);
      MCR_BLUEMS_F2I_1D(SensorValue, intPart, decPart);
      Temp2ToSend = intPart*10+decPart; 
    } else if(TargetBoardFeatures.NumTempSensors==1) {
      ENV_SENSOR_GetValue(TEMPERATURE_INSTANCE_1,ENV_TEMPERATURE,&SensorValue);
      MCR_BLUEMS_F2I_1D(SensorValue, intPart, decPart);
      Temp1ToSend = intPart*10+decPart; 
    }
    Environmental_Update(PressToSend,HumToSend,Temp2ToSend,Temp1ToSend);
  } else if (handle == StdErrCharHandle + 1) {
    /* Send again the last packet for StdError */
    Stderr_Update_AfterRead();
  } else if (handle == TermCharHandle + 1) {
    /* Send again the last packet for Terminal */
    Term_Update_AfterRead();
  }
 
  //EXIT:
  if(connection_handle != 0)
    aci_gatt_allow_read(connection_handle);
}

/**
 * @brief  This function is called when there is a change on the gatt attribute
 * With this function it's possible to understand if one application 
 * is subscribed or not to the one service
 * @param uint16_t att_handle Handle of the attribute
 * @param uint8_t *att_data attribute data
 * @param uint8_t data_length length of the data
 * @retval None
 */
static void Attribute_Modified_Request_CB(uint16_t Connection_Handle, uint16_t attr_handle, uint16_t Offset, uint8_t data_length, uint8_t *att_data)
{

  if (attr_handle == TaiChiCharHandle + 2){
	  TaiChi_AttributeModified_CB(att_data);
  }else if(attr_handle == ConfigCharHandle + 2){
    if (att_data[0] == 01) {
      FirstConnectionConfig=1;
    } else if (att_data[0] == 0){
      FirstConnectionConfig=0;
    }
  } else if(attr_handle == EnvironmentalCharHandle + 2){
    Environmental_AttributeModified_CB(att_data);
  } else if(attr_handle == AccGyroMagCharHandle + 2) {
    AccGyroMag_AttributeModified_CB(att_data);
  } else if (attr_handle == AudioLevelCharHandle + 2) {
    AudioLevel_AttributeModified_CB(att_data);
  } else if(attr_handle == BatteryFeaturesCharHandle + 2){
    BatteryFeatures_AttributeModified_CB(att_data);
  } else if (attr_handle == FFTAmplitudeCharHandle + 2) {
    FFTAmplitude_AttributeModified_CB(att_data);
  } else if (attr_handle == TimeDomainCharHandle + 2) {
    TimeDomain_AttributeModified_CB(att_data);
  } else if (attr_handle == FFTAlarmSpeedRMS_StatusCharHandle + 2) {
    FFTAlarmSpeedRMS_AttributeModified_CB(att_data);
  } else if (attr_handle == FFTAlarmAccStatusCharHandle + 2) {
    FFTAlarmAccStatus_AttributeModified_CB(att_data);
  } else if (attr_handle == FFTAlarmSubrangeStatusCharHandle + 2) {
      FFTAlarmSubrangeStatus_AttributeModified_CB(att_data);
  } else if(attr_handle == StdErrCharHandle + 2){
    if (att_data[0] == 01) {
      W2ST_ON_CONNECTION(W2ST_CONNECT_STD_ERR);
    } else if (att_data[0] == 0){
      W2ST_OFF_CONNECTION(W2ST_CONNECT_STD_ERR);
    }
  } else if(attr_handle == TermCharHandle + 2){
    if (att_data[0] == 01) {
      W2ST_ON_CONNECTION(W2ST_CONNECT_STD_TERM);
    } else if (att_data[0] == 0){
      W2ST_OFF_CONNECTION(W2ST_CONNECT_STD_TERM);
    }
  } else if (attr_handle == TermCharHandle + 1){
    uint32_t SendBackData =1; /* By default UserAnswer with the same message received */

