sicreative/ST_TaiChi/ST_TAICHI/Projects/STM32L4R9ZI-STWIN/Demonstrations/TaiChi/Src/sensor_service.c
    InitMics(AUDIO_IN_SAMPLING_FREQUENCY, AUDIO_VOLUME_INPUT);
    
    for(Count=0;Count<AUDIO_IN_CHANNELS;Count++) {
      RMS_Ch[Count]=0;
      DBNOISE_Value_Old_Ch[Count] =0;
    }
    
    /* Start the TIM Base generation in interrupt mode */
    if(HAL_TIM_Base_Start_IT(&TimAudioDataHandle) != HAL_OK){
      /* Starting Error */
      Error_Handler();
    }
  } else if (att_data[0] == 0) {
    W2ST_OFF_CONNECTION(W2ST_CONNECT_AUDIO_LEVEL);

    DeInitMics();

    /* Stop the TIM Base generation in interrupt mode */
    if(HAL_TIM_Base_Stop_IT(&TimAudioDataHandle) != HAL_OK){
      /* Stopping Error */
      Error_Handler();
    }      
  }
#ifdef PREDMNT1_DEBUG_CONNECTION
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
    BytesToWrite = sprintf((char *)BufferToWrite,"--->dB Noise AudioLevel=%s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_AUDIO_LEVEL)   ? " ON\r\n" : " OFF\r\n\n") );
    Term_Update(BufferToWrite,BytesToWrite);
  } else
    PREDMNT1_PRINTF("--->dB Noise AudioLevel=%s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_AUDIO_LEVEL)   ? " ON\r\n" : " OFF\r\n\n"));
#endif /* PREDMNT1_DEBUG_CONNECTION */
}

/**
 * @brief  This function is called when there is a change on the gatt attribute for Battery Features
 * With this function it's possible to understand if one application 
 * is subscribed or not to the Battery Features service
 * @param uint8_t *att_data attribute data
 * @retval None
 */
static void BatteryFeatures_AttributeModified_CB(uint8_t *att_data)
{
  if (att_data[0] == 01) {
    W2ST_ON_CONNECTION(W2ST_CONNECT_BATTERY_INFO);
   /* Start the TIM Base generation in interrupt mode */
   if(HAL_TIM_Base_Start_IT(&TimEnvHandle) != HAL_OK){
     /* Starting Error */
     Error_Handler();
   }
  } else if (att_data[0] == 0){
    W2ST_OFF_CONNECTION(W2ST_CONNECT_BATTERY_INFO);
   /* Stop the TIM Base generation in interrupt mode */
   if(HAL_TIM_Base_Stop_IT(&TimEnvHandle) != HAL_OK){
     /* Stopping Error */
     Error_Handler();
   }
  }
#ifdef ALLMEMS1_DEBUG_CONNECTION
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
    BytesToWrite =sprintf((char *)BufferToWrite,"---BatteryInfo=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_BATTERY_INFO) ? " ON\r\n" : " OFF\r\n\n");
    Term_Update(BufferToWrite,BytesToWrite);
  } else
    ALLMEMS1_PRINTF("--->BatteryInfo=%s", W2ST_CHECK_CONNECTION(W2ST_CONNECT_BATTERY_INFO) ? " ON\r\n" : " OFF\r\n\n");
#endif /* ALLMEMS1_DEBUG_CONNECTION */
}

/***********************************
* Software Characteristics Service *
************************************/

/**
 * @brief  This function is called when there is a change on the gatt attribute for FFT Amplitude
 * With this function it's possible to understand if one application 
 * is subscribed or not to the FFT Amplitude service
 * @param uint8_t *att_data attribute data
 * @retval None
 */
static void FFTAmplitude_AttributeModified_CB(uint8_t *att_data)
{
  if (att_data[0] == 01) {
    
    W2ST_ON_CONNECTION(W2ST_CONNECT_FFT_AMPLITUDE);
    
    if(!PredictiveMaintenance)
    {
      PredictiveMaintenance= 1;
      FFT_Amplitude= 1;
      IsFirstTime = 1;
    }
  } else if (att_data[0] == 0) {
    
    W2ST_OFF_CONNECTION(W2ST_CONNECT_FFT_AMPLITUDE);
    
    disable_FIFO();
    EnableDisable_ACC_HP_Filter(0);
    PredictiveMaintenance= 0;
    FFT_Amplitude= 0;
  }
  
#ifdef PREDMNT1_DEBUG_CONNECTION
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
    BytesToWrite = sprintf((char *)BufferToWrite,"\r\n--->FFT Amplitude= %s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_FFT_AMPLITUDE)   ? " ON\r\n" : " OFF\r\n") );
    Term_Update(BufferToWrite,BytesToWrite);
  } else {
    PREDMNT1_PRINTF("\r\n--->FFT Amplitude= %s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_FFT_AMPLITUDE)   ? " ON\r\n" : " OFF\r\n"));
  }
#endif /* PREDMNT1_DEBUG_CONNECTION */
}

/**
 * @brief  This function is called when there is a change on the gatt attribute for Time Domain
 * With this function it's possible to understand if one application 
 * is subscribed or not to the Time Domain service
 * @param uint8_t *att_data attribute data
 * @retval None
 */
static void TimeDomain_AttributeModified_CB(uint8_t *att_data)
{
  if (att_data[0] == 01) {
    W2ST_ON_CONNECTION(W2ST_CONNECT_TIME_DOMAIN);
  } else if (att_data[0] == 0) {
    W2ST_OFF_CONNECTION(W2ST_CONNECT_TIME_DOMAIN);
  }

#ifdef PREDMNT1_DEBUG_CONNECTION
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
    BytesToWrite = sprintf((char *)BufferToWrite,"--->Time Domain= %s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_TIME_DOMAIN)   ? " ON\r\n" : " OFF\r\n\n") );
    Term_Update(BufferToWrite,BytesToWrite);
  } else {
    PREDMNT1_PRINTF("--->Time Domain= %s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_TIME_DOMAIN)   ? " ON\r\n" : " OFF\r\n\n"));
  }
#endif /* PREDMNT1_DEBUG_CONNECTION */
}

/**
 * @brief  This function is called when there is a change on the gatt attribute for FFT Alarm Speed RMS
 * With this function it's possible to understand if one application 
 * is subscribed or not to the FFT Alarm Speed RMS service
 * @param uint8_t *att_data attribute data
 * @retval None
 */
static void FFTAlarmSpeedRMS_AttributeModified_CB(uint8_t *att_data)
{
  if (att_data[0] == 01) {
    W2ST_ON_CONNECTION(W2ST_CONNECT_FFT_ALARM_SPEED_RMS_STATUS);
  } else if (att_data[0] == 0) {
    W2ST_OFF_CONNECTION(W2ST_CONNECT_FFT_ALARM_SPEED_RMS_STATUS);
    disable_FIFO();
    EnableDisable_ACC_HP_Filter(0);
    PredictiveMaintenance= 0;
    FFT_Alarm= 0;
  }
  
#ifdef PREDMNT1_DEBUG_CONNECTION
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
    BytesToWrite = sprintf((char *)BufferToWrite,"\r\n--->FFT Alarm Speed RMS Status= %s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_FFT_ALARM_SPEED_RMS_STATUS)   ? " ON\r\n" : " OFF\r\n") );
    Term_Update(BufferToWrite,BytesToWrite);
  } else {
    PREDMNT1_PRINTF("\r\n--->FFT Alarm Speed RMS Status= %s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_FFT_ALARM_SPEED_RMS_STATUS)   ? " ON\r\n" : " OFF\r\n"));
  }
#endif /* PREDMNT1_DEBUG_CONNECTION */
}

/**
 * @brief  This function is called when there is a change on the gatt attribute for FFT Alarm Acc Status
 * With this function it's possible to understand if one application 
 * is subscribed or not to the FFT Alarm Acc Status service
 * @param uint8_t *att_data attribute data
 * @retval None
 */
static void FFTAlarmAccStatus_AttributeModified_CB(uint8_t *att_data)
{
  if (att_data[0] == 01) {
    W2ST_ON_CONNECTION(W2ST_CONNECT_FFT_ALARM_ACC_STATUS);
    if(!PredictiveMaintenance)
    {
      PredictiveMaintenance= 1;
      FFT_Alarm= 1;
      IsFirstTime = 1;
    }
  } else if (att_data[0] == 0) {
    W2ST_OFF_CONNECTION(W2ST_CONNECT_FFT_ALARM_ACC_STATUS);
  }
  
#ifdef PREDMNT1_DEBUG_CONNECTION
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
    BytesToWrite = sprintf((char *)BufferToWrite,"--->FFT Alarm Acc Status= %s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_FFT_ALARM_ACC_STATUS)   ? " ON\r\n" : " OFF\r\n\n") );
    Term_Update(BufferToWrite,BytesToWrite);
  } else {
    PREDMNT1_PRINTF("--->FFT Alarm Acc Status= %s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_FFT_ALARM_ACC_STATUS)   ? " ON\r\n" : " OFF\r\n\n"));
  }
#endif /* PREDMNT1_DEBUG_CONNECTION */
}

/**
 * @brief  This function is called when there is a change on the gatt attribute for FFT Alarm Subrange Status
 * With this function it's possible to understand if one application 
 * is subscribed or not to the FFT Alarm Subrange Status service
 * @param uint8_t *att_data attribute data
 * @retval None
 */
static void FFTAlarmSubrangeStatus_AttributeModified_CB(uint8_t *att_data)
{
  if (att_data[0] == 01) {
    W2ST_ON_CONNECTION(W2ST_CONNECT_FFT_ALARM_SUBRANGE_STATUS);
  } else if (att_data[0] == 0) {
    W2ST_OFF_CONNECTION(W2ST_CONNECT_FFT_ALARM_SUBRANGE_STATUS);
  }
  
#ifdef PREDMNT1_DEBUG_CONNECTION
  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
    BytesToWrite = sprintf((char *)BufferToWrite,"--->FFT Alarm Subrange Status= %s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_FFT_ALARM_SUBRANGE_STATUS)   ? " ON\r\n" : " OFF\r\n") );
    Term_Update(BufferToWrite,BytesToWrite);
  } else {
    PREDMNT1_PRINTF("--->FFT Alarm Subrange Status= %s", (W2ST_CHECK_CONNECTION(W2ST_CONNECT_FFT_ALARM_SUBRANGE_STATUS)   ? " ON\r\n" : " OFF\r\n"));
  }
#endif /* PREDMNT1_DEBUG_CONNECTION */
}

/**
 * @brief  This function makes the parsing of the Debug Console Commands
 * @param uint8_t *att_data attribute data
 * @param uint8_t data_length length of the data
 * @retval uint32_t SendItBack true/false
 */
static uint32_t DebugConsoleCommandParsing(uint8_t * att_data, uint8_t data_length)
{
  uint32_t SendBackData = 1;
  
  static uint8_t SetVibrParam= 0;

