sicreative/ST_TaiChi/ST_TAICHI/Projects/STM32L4R9ZI-STWIN/Demonstrations/TaiChi/Src/sensor_service.c
        BytesToWrite =sprintf((char *)BufferToWrite,"\nThe node nome has been updated\r\n");
        Term_Update(BufferToWrite,BytesToWrite);
        BytesToWrite =sprintf((char *)BufferToWrite,"Disconnecting and riconnecting to see the new node name\r\n");
        Term_Update(BufferToWrite,BytesToWrite);
      }
      else
      {
        BytesToWrite =sprintf((char *)BufferToWrite,"\nInsert the node name\r\n");
        Term_Update(BufferToWrite,BytesToWrite);
        BytesToWrite =sprintf((char *)BufferToWrite,"Use command: setName 'xxxxxxx'\r\n");
        Term_Update(BufferToWrite,BytesToWrite);
      }

      SendBackData=0;
    }

    if(SetVibrParam)
    {
      uint8_t Index=0;
     
      static uint8_t NumByte= 0;
      static uint8_t CommandLenght=0;
      
      while( (att_data[Index] != '\n') && (att_data[Index] != '\0') )
      {
        VibrParam[20*NumByte + Index]= att_data[Index];
        Index++;
        CommandLenght++;
      }
      
      NumByte++;
      
      if(att_data[Index] == '\n')
      {
        if(VibrationParametersCommandParsing(CommandLenght))
        {
          /* Save vibration parameters values to memory */
          SaveVibrationParamToMemory();
        }
        
        NumByte= 0;
        SetVibrParam=0;
        CommandLenght=0;
      }
      
      SendBackData= 0;
    }
    
#if 1

  /* If it's something not yet recognized... only for testing.. This must be removed*/
   if(SendBackData) {
    if(att_data[0]=='@') {

      if(att_data[1]=='T') {
        uint8_t loc_att_data[6];
        uint8_t loc_data_length=6;

        loc_att_data[0] = (FEATURE_MASK_TEMP1>>24)&0xFF;
        loc_att_data[1] = (FEATURE_MASK_TEMP1>>16)&0xFF;
        loc_att_data[2] = (FEATURE_MASK_TEMP1>>8 )&0xFF;
        loc_att_data[3] = (FEATURE_MASK_TEMP1    )&0xFF;
        loc_att_data[4] = 255;
        
        switch(att_data[2]) {
          case 'L':
            loc_att_data[5] = 50; /* @5S */
          break;
          case 'M':
            loc_att_data[5] = 10; /* @1S */
          break;
          case 'H':
            loc_att_data[5] = 1; /* @100mS */
          break;
          case 'D':
            loc_att_data[5] = 0; /* Default */
          break;
        }
        SendBackData = ConfigCommandParsing(loc_att_data,loc_data_length);
      } else if(att_data[1]=='A') {
        uint8_t loc_att_data[6];
        uint8_t loc_data_length=6;

        loc_att_data[0] = (FEATURE_MASK_ACC>>24)&0xFF;
        loc_att_data[1] = (FEATURE_MASK_ACC>>16)&0xFF;
        loc_att_data[2] = (FEATURE_MASK_ACC>>8 )&0xFF;
        loc_att_data[3] = (FEATURE_MASK_ACC    )&0xFF;
        loc_att_data[4] = 255;

        switch(att_data[2]) {
          case 'L':
            loc_att_data[5] = 50; /* @5S */
          break;
          case 'M':
            loc_att_data[5] = 10; /* @1S */
          break;
          case 'H':
            loc_att_data[5] = 1; /* @100mS */
          break;
          case 'D':
            loc_att_data[5] = 0; /* Default */
          break;
        }
        SendBackData = ConfigCommandParsing(loc_att_data,loc_data_length);
      } else if(att_data[1]=='M') {
        uint8_t loc_att_data[6];
        uint8_t loc_data_length=6;

        loc_att_data[0] = (FEATURE_MASK_MIC>>24)&0xFF;
        loc_att_data[1] = (FEATURE_MASK_MIC>>16)&0xFF;
        loc_att_data[2] = (FEATURE_MASK_MIC>>8 )&0xFF;
        loc_att_data[3] = (FEATURE_MASK_MIC    )&0xFF;
        loc_att_data[4] = 255;

        switch(att_data[2]) {
          case 'L':
            loc_att_data[5] = 50; /* @5S */
          break;
          case 'M':
            loc_att_data[5] = 10; /* @1S */
          break;
          case 'H':
            loc_att_data[5] = 1; /* @100mS */
          break;
          case 'D':
            loc_att_data[5] = 0; /* Default */
          break;
        }
        SendBackData = ConfigCommandParsing(loc_att_data,loc_data_length);
      }    
    }
  }
#endif
  
  return SendBackData;
}

/**
 * @brief  This function makes the parsing of the set Vibration Parameter Commands
 * @param uint8_t CommandLenght length of the data
 * @retval UpdatedParameters
 */
static uint8_t VibrationParametersCommandParsing(uint8_t CommandLenght)
{
  uint8_t UpdatedParameters= 0;
  uint8_t UpdatedAccParameters= 0;
  
  uint8_t i=7;
  uint32_t Param[7];
  uint8_t DigitNumber;
  uint8_t ParamFound;
  
  int Index= 13;
  
  if(Index >= CommandLenght)
  {
    BytesToWrite =sprintf((char *)BufferToWrite,"\r\nParameters not found\r\n");
    Term_Update(BufferToWrite,BytesToWrite);
  }  
  
  while(Index < CommandLenght)
  {
    Index++;
    ParamFound= 0;
    
    if((VibrParam[Index]=='o') & (VibrParam[Index+1]=='d') & (VibrParam[Index+2]=='r'))
    {
      Index+= 4;
      i=0;
      ParamFound= 1;
    }
    
    if((VibrParam[Index]=='f') & (VibrParam[Index+1]=='s'))
    {
      Index+= 3;
      i=1;
      ParamFound= 1;
    }
    
    if((VibrParam[Index]=='s') & (VibrParam[Index+1]=='i') & (VibrParam[Index+2]=='z') & (VibrParam[Index+3]=='e'))
    {
      Index+= 5;
      i=2;
      ParamFound= 1;
    }
    
    if((VibrParam[Index]=='w') & (VibrParam[Index+1]=='i') & (VibrParam[Index+2]=='n') & (VibrParam[Index+3]=='d'))
    {
      Index+= 5;
      i=3;
      ParamFound= 1;
    }
    
    if((VibrParam[Index]=='t') & (VibrParam[Index+1]=='a') & (VibrParam[Index+2]=='c') & (VibrParam[Index+3]=='q'))
    {
      Index+= 5;
      i=4;
      ParamFound= 1;
    }
    
    if((VibrParam[Index]=='o') & (VibrParam[Index+1]=='v') & (VibrParam[Index+2]=='l') )
    {
      Index+= 4;
      i=5;
      ParamFound= 1;
    }
    
    if((VibrParam[Index]=='s') & (VibrParam[Index+1]=='u') & (VibrParam[Index+2]=='b') & (VibrParam[Index+3]=='r') & (VibrParam[Index+4]=='n') & (VibrParam[Index+5]=='g'))
    {
      Index+= 7;
      i=6;
      ParamFound= 1;
    }
      
    if(ParamFound == 1)
    {
      ParamFound= 0;
      
