sicreative/ST_TaiChi/ST_TAICHI/Projects/STM32L4R9ZI-STWIN/Demonstrations/TaiChi/Src/sensor_service.c
      DigitNumber= 0;
      while( (VibrParam[Index + DigitNumber] != ' ') &&
             (VibrParam[Index + DigitNumber] != '\r') &&
             (VibrParam[Index + DigitNumber] != '\0') )
        DigitNumber++;
      
      Param[i]= VibrParam[Index + DigitNumber - 1] & 0x0F;
      
      if(DigitNumber > 1)
      {
        for(int t=1; t<DigitNumber; t++)
        {
          Param[i]= Param[i] + ( (VibrParam[Index + DigitNumber - t - 1] & 0x0F) * ((uint32_t)pow(10.0,t)) );
        }           
      }

      switch(i)
      {
      /* FifoOdr (FIFO Accelerometer Output Data Rate in Hz) */
      case 0:
        if( (Param[i] == 13)   || (Param[i] == 26)   || (Param[i] == 52)   ||
            (Param[i] == 104)  || (Param[i] == 208)  || (Param[i] == 416)  ||
            (Param[i] == 833)  || (Param[i] == 1660) || (Param[i] == 3330) || (Param[i] == 6660)
           )
        {
          Accelerometer_Parameters.FifoOdr= Param[i];
          Accelerometer_Parameters.AccOdr=  Param[i];
          UpdatedParameters= 1;
          UpdatedAccParameters= 1;
        }
        else
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"\r\nValue out of range for odr\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
        }
        break;
      /* fs (Full Scale in g) */
      case 1:
        if( (Param[i] == 2) || (Param[i] == 4) || (Param[i] == 8) || (Param[i] == 16) )
        {
          Accelerometer_Parameters.fs= Param[i];
          UpdatedParameters= 1;
          UpdatedAccParameters= 1;
        }
        else
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"\r\nValue out of range for fs\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
        }
        break;
      /* size (FFT SIZE) */
      case 2:
        if( (Param[i] == 256) || (Param[i] == 512) || (Param[i] == 1024) || (Param[i] == 2048))
        {
          MotionSP_Parameters.FftSize= Param[i];
          UpdatedParameters= 1;
        }          
        else
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"\r\nValue out of range for size\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
        }
        break;
      /*  wind (PRE-FFT WINDOWING Method) */
      case 3:
        if(Param[i] < 4)
        {
          MotionSP_Parameters.window= Param[i];
          UpdatedParameters= 1;
        }          
        else
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"\r\nValue out of range for wind\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
        }
        break;
      /* tacq (TIME ACQUISITION WINDOW in ms) */
      case 4:
        if( (Param[i] >= 500) && (Param[i] <= 60000) )
        {
          MotionSP_Parameters.tacq= Param[i];
          UpdatedParameters= 1;
        }          
        else
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"\r\nValue out of range for tacq\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
        }
        break;
      /* ovl (FFT OVERLAPPING in %) */
      case 5:
        if( (Param[i] >= 5) && (Param[i] <= 95) )
        {
          MotionSP_Parameters.FftOvl= Param[i];
          UpdatedParameters= 1;
        }
        else
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"\r\nValue out of range for ovl\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
        }
        break;
      /*  subrng (SUBRANGE number for evaluate thresholds) */
      case 6:
        if( (Param[i] == 8) || (Param[i] == 16) || (Param[i] == 32) || (Param[i] == 64) )
        {
          MotionSP_Parameters.subrange_num= Param[i];
          UpdatedParameters= 1;
        }
        else
        {
          BytesToWrite =sprintf((char *)BufferToWrite,"\r\nValue out of range for nsubrng\r\n");
          Term_Update(BufferToWrite,BytesToWrite);
        }
        break;
      }
      
      Index= Index + DigitNumber + 1;
    }
    else
    {
      if(VibrParam[Index] != '-')
      {
        BytesToWrite =sprintf((char *)BufferToWrite,"\r\nParam not found\r\n");
        Term_Update(BufferToWrite,BytesToWrite);
      }
    }
  }
  
  BytesToWrite =sprintf((char *)BufferToWrite,"\r\nOK\r\n");
  Term_Update(BufferToWrite,BytesToWrite);  
  
//  BytesToWrite =sprintf((char *)BufferToWrite,"\r\nNew accelerometer parameters:\r\n");
//  Term_Update(BufferToWrite,BytesToWrite);
//  BytesToWrite =sprintf((char *)BufferToWrite,"FifoOdr= %d fs= %d\r\n",
//                        Accelerometer_Parameters.FifoOdr,
//                        Accelerometer_Parameters.fs);
//  Term_Update(BufferToWrite,BytesToWrite);
//  
//  BytesToWrite =sprintf((char *)BufferToWrite,"New MotionSP parameters:\r\n");
//  Term_Update(BufferToWrite,BytesToWrite);
//  BytesToWrite =sprintf((char *)BufferToWrite,"size= %d wind= %d tacq= %d ovl= %d subrng= %d\r\n",
//                        MotionSP_Parameters.FftSize,
//                        MotionSP_Parameters.window,
//                        MotionSP_Parameters.tacq,
//                        MotionSP_Parameters.FftOvl,
//                        MotionSP_Parameters.subrange_num);
//  Term_Update(BufferToWrite,BytesToWrite);
  
  if(UpdatedAccParameters)
    SetAccelerometerParameters();
  
  return UpdatedParameters;
}

/**
 * @brief  This function makes the parsing of the Configuration Commands
 * @param uint8_t *att_data attribute data
 * @param uint8_t data_length length of the data
 * @retval uint32_t SendItBack true/false
 */
static uint32_t ConfigCommandParsing(uint8_t * att_data, uint8_t data_length)
{
  FeatureMask = (att_data[3]) | (att_data[2]<<8) | (att_data[1]<<16) | (att_data[0]<<24);
  uint8_t Command = att_data[4];
  uint8_t Data    = att_data[5];
  uint32_t SendItBack = 1;

  switch (FeatureMask) {
    /* Environmental features */
    case FEATURE_MASK_TEMP1:
    case FEATURE_MASK_TEMP2:
    case FEATURE_MASK_PRESS:
    case FEATURE_MASK_HUM:
      switch(Command) {
        case 255:
          /* Change the Sending interval */
          if(Data!=0) {
            /* Multiple of 100mS */
            __HAL_TIM_SET_AUTORELOAD(&TimEnvHandle,(((Data*TIM_CLOCK_ENV) / 10U) - 1));
            __HAL_TIM_SET_COUNTER(&TimEnvHandle,0);
            TimEnvHandle.Instance->EGR = TIM_EGR_UG;
          } else {
            /* Default Values */
            __HAL_TIM_SET_AUTORELOAD(&TimEnvHandle,((TIM_CLOCK_ENV  / ALGO_FREQ_ENV) - 1));
            __HAL_TIM_SET_COUNTER(&TimEnvHandle,0);
          }
#ifdef PREDMNT1_DEBUG_CONNECTION
          if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
            BytesToWrite = sprintf((char *)BufferToWrite,"Conf Sig F=%lx C=%2x Data=%2x\n\r",FeatureMask,Command,Data);
            Term_Update(BufferToWrite,BytesToWrite);
          } else {
            PREDMNT1_PRINTF("Conf Sig F=%lx C=%2x Data=%2x\n\r",FeatureMask,Command,Data);
          }
#endif /* PREDMNT1_DEBUG_CONNECTION */
          SendItBack = 0;
        break;
      }
    break;
    /* Inertial features */
    case FEATURE_MASK_ACC:
    case FEATURE_MASK_GRYO:
    case FEATURE_MASK_MAG:
      switch(Command) {
        case 255:
          /* Change the Sending interval */
          if(Data!=0) {
            /* Multiple of 100mS */
            uhCCR4_Val  = 1000*Data;
          } else {
            /* Default Value */
            uhCCR4_Val  = DEFAULT_uhCCR4_Val;
          }
#ifdef PREDMNT1_DEBUG_CONNECTION
          if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
            BytesToWrite = sprintf((char *)BufferToWrite,"Conf Sig F=%lx C=%2x Data=%2x\n\r",FeatureMask,Command,Data);
            Term_Update(BufferToWrite,BytesToWrite);
          } else {
            PREDMNT1_PRINTF("Conf Sig F=%lx C=%2x Data=%2x\n\r",FeatureMask,Command,Data);
          }
#endif /* PREDMNT1_DEBUG_CONNECTION */
          SendItBack = 0;
        break;
      }
    break;
    /* Environmental features */
    case FEATURE_MASK_MIC:
      switch(Command) {
        case 255:
          /* Change the Sending interval */
          if(Data!=0) {
            /* Multiple of 100mS */
            __HAL_TIM_SET_AUTORELOAD(&TimAudioDataHandle,(((Data*TIM_CLOCK_AUDIO_LEVEL) / 10U) - 1));
            __HAL_TIM_SET_COUNTER(&TimAudioDataHandle,0);
            TimAudioDataHandle.Instance->EGR = TIM_EGR_UG;
          } else {
            /* Default Values */
            __HAL_TIM_SET_AUTORELOAD(&TimAudioDataHandle,((TIM_CLOCK_AUDIO_LEVEL / ALGO_FREQ_AUDIO_LEVEL) - 1));
            __HAL_TIM_SET_COUNTER(&TimAudioDataHandle,0);
          }
#ifdef PREDMNT1_DEBUG_CONNECTION
          if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
            BytesToWrite = sprintf((char *)BufferToWrite,"Conf Sig F=%lx C=%2x Data=%2x\n\r",FeatureMask,Command,Data);
            Term_Update(BufferToWrite,BytesToWrite);
          } else {
            PREDMNT1_PRINTF("Conf Sig F=%lx C=%2x Data=%2x\n\r",FeatureMask,Command,Data);
          }
#endif /* PREDMNT1_DEBUG_CONNECTION */
          SendItBack = 0;
        break;
      }
    break;
  }
  return SendItBack;
}

/**
 * @brief  Force one UUID rescan
 * @param  None
 * @retval None
 */
static void Force_UUID_Rescan(void)
{
  tBleStatus ret;
  
  uint8_t buff[4];

  /* Delete all the Handles from 0x0001 to 0xFFFF */
  STORE_LE_16(buff  ,0x0001);
  STORE_LE_16(buff+2,0xFFFF);

  ret = aci_gatt_update_char_value(0x0001,0x0002,0,4,buff);

  if (ret == BLE_STATUS_SUCCESS){
    PREDMNT1_PRINTF("UUID Rescan Forced\r\n\r\n");
  } else {
    PREDMNT1_PRINTF("Problem forcing UUID Rescan\r\n\r\n");
  }
}

/* ***************** BlueNRG-2 Stack Callbacks ********************************/

